<h1 style='text-align: center'>SQL Queries</h1>

## More Practice

The [Chinook database](https://github.com/lerocha/chinook-database) is a sample database, representing a digital media store.

You need to create a query that can rank tracks in term of popularity.

The name of the database is `Chinook_Sqlite.sqlite`

Database information:<br>
- How many tables are in the database?
- What's the primary key of each table?
- What foreign keys join the tables together?
- If you had to draw a schema of how the tables are connected, what would it look like?

To answer the question:<br>
- What are the max and min dates in the Invoice table?
- What tables would you need to answer "what is your most popular track?"
- What values from each table?

In [1]:
import sqlite3
import pandas as pd
conn = sqlite3.connect('data/Chinook_Sqlite.sqlite')
cur = conn.cursor()

In [2]:
# Creating a dataframe using the dataframe method
cur.execute("""SELECT * FROM sqlite_master
            WHERE type = "table"
            """)
df = pd.DataFrame(cur.fetchall())
df.head()

,0,1,2,3,4
0,table,Album,Album,2,CREATE TABLE [Album]\n(\n [AlbumId] INTEGER...
1,table,Artist,Artist,3,CREATE TABLE [Artist]\n(\n [ArtistId] INTEG...
2,table,Customer,Customer,4,CREATE TABLE [Customer]\n(\n [CustomerId] I...
3,table,Employee,Employee,7,CREATE TABLE [Employee]\n(\n [EmployeeId] I...
4,table,Genre,Genre,9,CREATE TABLE [Genre]\n(\n [GenreId] INTEGER...

In [3]:
# How many tables are in the database?
# 11

# your code here

pd.read_sql_query("""
                  SELECT count(*)
                  FROM sqlite_master
                  WHERE type = "table"
                  """, conn)

   count(*)
0        11

In [4]:
# What's the primary key of each table?

# A primary key is a field in a table 
# which uniquely identifies each row/record in a database table.

# your code here

pd.read_sql_query("""
                  PRAGMA table_info("Album");
                  """, conn)

   cid      name           type  notnull dflt_value  pk
0    0   AlbumId        INTEGER        1       None   1
1    1     Title  NVARCHAR(160)        1       None   0
2    2  ArtistId        INTEGER        1       None   0

In [5]:
for name in names_df.values:
    pd.read_sql_query("""
                  PRAGMA table_info("Album");
                  """.format(table_name=name[0]), conn)

NameError: name 'names_df' is not defined

In [ ]:
# What foreign keys join the tables together?

# your code here
# hint: use "PRAGMA foreign_key_list()"

pd.read_sql_query("""PRAGMA foreign_key_list("PlaylistTrack")""", conn)

In [6]:
# What are the max and min dates in the Invoice table?
pd.read_sql_query("""
SELECT max(InvoiceDate) AS max_date
       min(InvoiceDate) AS min_date
FROM Invoice""", conn)

DatabaseError: Execution failed on sql '
SELECT max(InvoiceDate) AS max_date
       min(InvoiceDate) AS min_date
FROM Invoice': near "min": syntax error

In [ ]:
# What tables would you need to answer "what is your most popular track?"
- name of track (Track)
- InvoiceLine
- Album
- Track.ArtistID

In [ ]:
# What values from each table?
- Track.Name
- InvoiceLine.TrackID
- Album
- Artist.Name

In [ ]:
# Put it all together:
# You need to create a query that can rank tracks in term of popularity.

pd.read_sql_query("""
SELECT t.Name AS track_name, ar.Name AS artist_name
FROM Track t
JOIN InvoiceLine il USING (TrackId)
JOIN Album al ON t.AlbumId = al.AlbumId
JOIN Artist ar ON ar.ArtistId = ar.ArtistId

GROUP BY 1, 2
ORDER BY count(*) DESC
""", conn)




# results = cur.execute("""
# -- your code here;
# """).fetchall()

# print(*results, sep='\n')

In [7]:
# Advanced: get the artist who sang the song!
results = cur.execute("""
-- your code here;
""").fetchall()

print(*results, sep='\n')

## Getting Data From A SQL Database

### The Structure of a SQL Query

<img src='images/sql_statement.jpg'/>

#### GROUP BY

- Group columns by similar values
- SELECT COUNT(id), city from students GROUP BY city

#### HAVING

- Use to apply filter AFTER a `GROUP BY` based on aggregate criteria 
- `WHERE` is applied for conditions prior to the `GROUP BY`, `HAVING` is applied afterwards

For example, if we had a table of student names and the courses they were taking, we could ask a question such as which classes have 3 or more students with the name Matt?

Such a query would look something like this:

```SQL
SELECT
  class,
  COUNT(student_name) AS number_of_matts
FROM student_courses
WHERE student_name = "Matt"
GROUP BY 1
HAVING COUNT(student_name) >= 3;
```

In [8]:
import sqlite3

conn = sqlite3.connect('tutorial.db')
c = conn.cursor()

In [9]:
import pymysql

conn_mysql = pymysql.connect(host="fisdemo010620.cldoesqride0e.us-east-1.rds.amazonaws.com",
                            user="fis_student",
                            password="SuperSafePassword",
                            database="fis")

ModuleNotFoundError: No module named 'pymysql'

In [ ]:
columns = [x[0] for x in c.execute('select * from students').description]

In [ ]:
columns

### Questions
1. What are the names of all of the students?
2. Which student has the most siblings?
3. How many students are only children?
4. Which 3 students have lived in NYC the shortest amount of time?
5. How many students are native New Yorkers?
6. Do any two students have the same favorite food?

1. What are the names of all of the students.

In [ ]:
c.execute('''
-- YOUR CODE HERE
''').fetchall()

2. Which student has the most siblings?

> This is great place to use a subquery. Encourage students who are initially struggling with a question along the lines of "How could you select the largest number of siblings that anyone has in the group?" From there, you can further push students with a hint if needed: "How can you now make a selection using the result of this, [embedded as a subquery]?"

In [ ]:
pd.read_sql_query("""
SELECT
    name, siblings
FROM students
ORDER BY siblings DESC
LIMIT 1
""", conn_mysql)

3. How many students are only children?

In [ ]:
c.execute("""
-- YOUR CODE HERE
""").fetchone()

4. Which 3 students have lived in NYC the shortest amount of time? (How long has each lived in NYC?)

In [ ]:
c.execute('''
-- YOUR CODE HERE
''').fetchall()

5. How many students are native New Yorkers?

In [ ]:
c.execute('''
-- YOUR CODE HERE
''').fetchall()

6. Do any two students have the same favorite food?

This problem employs the `Having` clause.  Be sure to review the difference between the where and having clause here. (Where filters apply before the group by clause and conditions following the having clause are filters applied after the group by on the resulting aggregate [statistics].) A useful example in doing so, could be to modify the question to something with an additional filtering criterion such as 'do any native new yorkers have the same favorite food?' This would force students to use a where clause prior to the group by to filter the results. Alternatively, see the question below for an alternative but related problem on favorite foods.

In [ ]:
c.execute("""SELECT favorite_food, count(favorite_food)
FROM students
GROUP BY favorite_food
HAVING count(favorite_food) > 1
""").fetchall()

## More Questions

What are the favorite foods of this classroom?

In [ ]:
c.execute("""
-- YOUR CODE HERE
""").fetchall()

7. Which student was born closest to the cohort's graduation date?

In [ ]:
c.execute('''
-- YOUR CODE HERE
''').fetchall()